
const weaponsRus = {

    mainText: {

        textTitle: 'Заголовок',

        textDescr: 'Описание'

    },

    human:{

        meleeWeapons: {

            mainText: {

                name: 'Оружие ближнего боя',

                descr: 'Description'

            },

            weapons: {

                pilas: {

                    name: 'Пилас',
    
                    descr: 'Description'
    
                },
    
                bronus: {
    
                    name: 'Бронус',
    
                    descr: 'Description'
    
                },
    
                dagius: {
    
                    name: 'Дагиус',
    
                    descr: 'Description'
    
                }

            }

        },

        rangeWeapons: {

            mainText: {

                name: 'Дальнобойное оружие',

                descr: 'Description',

            },

            weapons: {

                crossbow: {

                    name: 'Арбалет',
    
                    descr: 'Арбалет превосходит обычный лук, кроме эльфийских, по точности стрельбы и убойной силе, но он сильно проигрываrет луку по скорострельности. Популярности способствовало то, что для обучения стрельбе из арбалета требовалось намного меньше времени по сравнению с обучением искусству стрельбы из лука. Конструкция и убойная мощь арбалетов гномов и имперцев не отличается, ведь со временем люди стали использывать гномье дальнобойное оружие, хоть и сохранив привычное для себя название - соленарий.'
    
                },
    
                bow: {
    
                    name: 'Лук',
    
                    descr: ''
    
                },
    
                arcebus: {
    
                    name: 'Аркебуза',
    
                    descr: 'Аркебуза в руках солдат эффективное и опасное оружием. Залп ряда аркебузеров может уничтожить первые ряды пехоты врага, остановить скачущую кавалерию, выбить всадника из седла. Дальность стрельбы уступает, как арбалету, так и луку, однако пробивная мощь намного выше. Существует так же ограничение в использовании, связанное с погодой. Порох приходил в негодность от воздействия влаги, из-за чего оружие было бесполезным.'
    
                }

            }

        },

        magicWeapons: {

            mainText: {

                name: 'Магическое оружие',

                descr: 'Description'

            },

            weapons: {

                rod: {

                    name: 'Жезл',
    
                    descr: 'С давних времён, люди не имели врождённой восприимчевости к магии. И только после договора с Тенебриусом, имперцы получили то, что помогло бы им сражаться на равных. Однако, магия людей и эльфов работает по разному. Люди используют жезлы, которые получают после личного договора с Тенебриусом и которые позволяют использовать силу Тёмного лорда. Жезлы созданны из миллетала - особого металла, который находиться во владениях Тенебриуса. Принцип работы жезла таков: произнося определённые слова, жезл на них реагирует и наделяет владельца определённой силой. Однако, жезл должен быть всегда с собой, иначе пользователь не сможет получить силу Тёмного владыки. После смерти владельца, его душа уходит к Тенебриусу, как и сила жезла. Его же оболочка является желанной добычей для коллекционеров.'
    
                },
    
                spatra: {
    
                    name: 'Спатра',
    
                    descr: 'Description'
    
                },
    
                wardius: {
    
                    name: 'Вардиус',
    
                    descr: 'После трёх Дардерианских войн, имперская военная машина не могла не заметить префосходство эльфийских глеф, усиленных магией, над алебардами. Совместно с имперскими магами, глефа была адаптирована под пользование людей оружейниками. Так как легионеры имеют высокую сопротивляемость магии, использование нового оружия в легионах не подразумевается. Вардиус можно встреть у Корпуса часовых, агентов Имперской разведки, Орлинной гвардии и у юстициариев.'
                    
                }

            }

        },

        defenceWeapons: {

            mainText: {

                name: 'Оборонительное оружие',

                descr: 'Description'

            },

            weapons: {

                skartos: {

                    name: 'Скартос',
    
                    descr: 'Классический щит легионеров. Один из символов легионов, который изначально был не из стали. В отличии от парфы, который всегда был из металла, скартос делался из дерева. Во время длительных дождливых или снежных периодов, а так же во время интессивных боёв, щит быстро приходил в негодность. После личной унии гномов Священного Камня и императора Карла I Униата, имперцы получили доступ к шахтам, которые были богаты различными металлами. С этой отправной точки и начинается путь современного скартоса. Усиленный защитой от магии, он стал гордостью гномов и людей, которые совместно смогли создать шедевр военного ремесла. Главным минусом скартоса является его размер и вес. За пределами легиона никто использовать его не сможет в ввиду его габаритов.'
    
                },
    
                partha: {
    
                    name: 'Парфа',
    
                    descr: 'Щит, которым пользуються часовые. После реформы Адриана, было сформирована новая имперская структура. Эта структура получила название - Корпус часовых. Их обязанности отличались от обязанностей легионеров, поэтому вооружение легионов часовым не подходило. Отсюда и начинается путь парфы. Облегчённый, по сравнению с щитом легионеров, парфа слегка уступает в живучести, но имеет повышенную сопротивляемость магии. Благодарю закруглённым краям, парфа не затрудняет обзор, как скартос, но и делает обладателя более уязвимым к атакам с растояния.'
    
                }

            }

        }
    },

    dwarf: {

        meleeWeapons: {

            mainText: {

                name: 'Оружие ближнего боя',

                descr: 'Description'

            },

            weapons: {

                hastar: {

                    name: 'Гастар',
    
                    descr: 'Description'
    
                },
    
                axe: {
    
                    name: 'Топор',
    
                    descr: 'Description'
    
                },
    
                scramandor: {
    
                    name: 'Скрамандор',
    
                    descr: 'Description'
    
                }

            }

        },

        rangeWeapons: {

            mainText: {

                name: 'Дальнобойное оружие',

                descr: 'Description',

            },

            weapons: {

                crossbow: {

                    name: 'Арбалет',
    
                    descr: 'Арбалет превосходит обычный лук, кроме эльфийского, по точности стрельбы и убойной силе, но он сильно проигрываrет луку по скорострельности. Популярности способствовало то, что для обучения стрельбе из арбалета требовалось намного меньше времени по сравнению с обучением искусству стрельбы из лука. Конструкция и убойная мощь арбалетов гномов и имперцев не отличается, ведь со временем люди стали использывать это оружие гномьего образца, хоть и сохранив привычное для себя название - соленарий.'
    
                },
    
                arcebus: {
    
                    name: 'Аркебуза',
    
                    descr: 'Аркебуза в руках солдат эффективное и опасное оружием. Залп ряда аркебузеров может уничтожить первые ряды пехоты врага, остановить скачущую кавалерию, выбить всадника из седла. Дальность стрельбы уступает, как арбалету, так и луку, однако пробивная мощь намного выше. Существует так же ограничение в использовании, связанное с погодой. Порох приходил в негодность от воздействия влаги, из-за чего оружие было бесполезным.'
    
                }

            }

        },

        defenceWeapons: {

            mainText: {

                name: 'Оборонительное оружие',

                descr: 'Description'

            },

            weapons: {

                rundskold: {

                    name: 'Рундскольд',
    
                    descr: 'Description'
    
                },
    
                storskold: {
    
                    name: 'Сторскольд',
    
                    descr: 'Description'
    
                }

            }

        }

    },

    elf: {

        meleeWeapons: {

            mainText: {

                name: 'Оружие ближнего боя',

                descr: 'Description'

            },

            weapons: {

                tabar: {

                    name: 'Табар',
    
                    descr: 'Description'
    
                },
    
                talwar: {
    
                    name: 'Талвар',
    
                    descr: 'Description'
    
                },

                bhaala: {

                    name: 'Бхаала',
    
                    descr: 'Description'

                }

            }

        },

        rangeWeapons: {

            mainText: {

                name: 'Дальнобойное оружие',

                descr: 'Description',

            },

            weapons: {
    
                elfbow: {
    
                    name: 'Эльфийский длинный лук',
    
                    descr: ''
    
                },

            }

        },

        magicWeapons: {

            mainText: {

                name: 'Магическое оружие',

                descr: 'Description'

            },

            weapons: {

                staff: {

                    name: 'Магический посох',
    
                    descr: 'description'
    
                },
    
                glaive: {
    
                    name: 'Глефа',
    
                    descr: 'Вид древкового пехотного холодного оружия ближнего боя. Состоит из древка и наконечника. Изначально древко было деревянным, но со временем стало делаться из металлов. Это решение было принято, после случаев перерубывания древка оружием врага. Однако, это и увеличело вес оружия и уменьшило скорость его атаки. Глефы усиленны магическими заклинаниями, что увеличивает их, и без того большую мощь.'
    
                },
    
                gada: {
    
                    name: 'Гада',
    
                    descr: 'description'
                    
                }

            }

        },

        defenceWeapons: {

            mainText: {

                name: 'Оборонительное оружие',

                descr: 'Description'

            },

            weapons: {

                kidaal: {

                    name: 'Ки`даал',
    
                    descr: 'Description'
    
                },
    
                shikidaal: {
    
                    name: 'Шики`даал',
    
                    descr: 'Description'
    
                }

            }

        }

    }
}

export default weaponsRus;