
const weaponsRus = {

    mainText: {

        textTitle: 'Заголовок',

        textDescr: 'Описание'

    },

    humanWeapons:{

        meleeWeapons: {

            nameTypeWeapon: 'Оружие ближнего боя',

            pilas: {

                weaponsName: 'Пилас',

                weaponsDescr: 'Description'

            },

            bronus: {

                weaponsName: 'Бронус',

                weaponsDescr: 'Description'

            },

            dagius: {

                weaponsName: 'Дагиус',

                weaponsDescr: 'Description'

            }

        },

        rangeWeapons: {

            nameTypeWeapon: 'Дальнобойное оружие',

            crossbow: {

                weaponsName: 'Арбалет',

                weaponsDescr: 'Для прикрытия неповоротливых и уязвимых для стрелком построений легионеров, существуют лёгкие подразделения дальнего боя. Основным оружием дальнего боя был и остаёться арбалет, не смотря на распространение огнестрельного оружия гномов. Арбалет призван пробивать доспехи и бороться с тяжёлыми войсками, однако, скорость стрельбы оставляет желать лучшего. Не зря, многие скауты предпочитают лук, который даёт пользователю больше мобильности, а скорость стрельбы куда выше, чем у арбалета. Несмотря на недостатки, арбалет остаёться доминирующим оружием дальнего боя в Корпусе часовых и Легионе, как проверенное временем оружие.'

            },

            bow: {

                weaponsName: 'Лук',

                weaponsDescr: 'Одно из древнейших орудий для убийства. Изначально, имперцы боролись исключительно с армиями, тактика которых, не отличалась от тактики их самих. Поэтому, для борьбы с тяжёлой пехотой предпочтение отдавали арбалету, а не луку. Ситуация изменилась, когда имперцы вступили в конфликт с эльфами. Осознав превосходство в скорости и мобильности эльфов-лучников и малочисленность тяжёлых бойцов у эльфов, бойцы стали возвращаться к лукам. Однако, эльфийский лук превосходит человеческий по всем параметрам и поэтому, имперские стрелки крайне неохотно вступают в дуели на дальних дистанциях с эльфами .'

            },

            musket: {

                weaponsName: 'Мушкет',

                weaponsDescr: 'Новейшее поступление в имперские вооружённые силы. Совместная разработка инженеров гномов и имперских оружейников поистине страшное оружие. Сила выстрела сильнее, чем у арбалета, как и пробиваемость брони. Однако, существуют и недостатки. Низкая скорость стрельбы, а так же уязвимость к влаге тормозят перевооружение имперских войск. '

            }

        },

        magicWeapons: {

            nameTypeWeapon: 'Магическое оружие',

            rod: {

                weaponsName: 'Жезл',

                weaponsDescr: 'С давних времён, люди не имели врождённой восприимчевости к магии. И только после договора с Тенебриусом, имперцы получили то, что помогло бы им сражаться на равных. Однако, магия людей и эльфов работает по разному. Люди используют жезлы, которые получают после личного договора с Тенебриусом и которые позволяют использовать силу Тёмного лорда. Жезлы созданны из миллетала - особого металла, который находиться во владениях Тенебриуса. Принцип работы жезла таков: произнося определённые слова, жезл на них реагирует и наделяет владельца определённой силой. Однако, жезл должен быть всегда с собой, иначе пользователь не сможет получить силу Тёмного владыки. После смерти владельца, его душа уходит к Тенебриусу, как и сила жезла. Его же оболочка является желанной добычей для коллекционеров.'

            },

            spatra: {

                weaponsName: 'Спатра',

                weaponsDescr: 'Description'

            },

            wardius: {

                weaponsName: 'Вардиус',

                weaponsDescr: 'После трёх Дардерианских войн, имперская военная машина не могла не заметить префосходство эльфийских глеф, усиленных магией, над алебардами. Совместно с имперскими магами, глефа была адаптирована под пользование людей оружейниками. Так как легионеры имеют высокую сопротивляемость магии, использование нового оружия в легионах не подразумевается. Вардиус можно встреть у Корпуса часовых, агентов Имперской разведки, Орлинной гвардии и у юстициариев.'
                
            }

        },

        defenceWeapons: {

            nameTypeWeapon: 'Оборонительное оружие',

            skartos: {

                weaponsName: 'Скартос',

                weaponsDescr: 'Классический щит легионеров. Один из символов легионов, который изначально был не из стали. В отличии от парфы, который всегда был из металла, скартос делался из дерева. Во время длительных дождливых или снежных периодов, а так же во время интессивных боёв, щит быстро приходил в негодность. После личной унии гномов Священного Камня и императора Карла I Униата, имперцы получили доступ к шахтам, которые были богаты различными металлами. С этой отправной точки и начинается путь современного скартоса. Усиленный защитой от магии, он стал гордостью гномов и людей, которые совместно смогли создать шедевр военного ремесла. Главным минусом скартоса является его размер и вес. За пределами легиона никто использовать его не сможет в ввиду его габаритов.'

            },

            partha: {

                weaponsName: 'Парфа',

                weaponsDescr: 'Щит, которым пользуються часовые. После реформы Адриана, было сформирована новая имперская структура. Эта структура получила название - Корпус часовых. Их обязанности отличались от обязанностей легионеров, поэтому вооружение легионов часовым не подходило. Отсюда и начинается путь парфы. Облегчённый, по сравнению с щитом легионеров, парфа слегка уступает в живучести, но имеет повышенную сопротивляемость магии. Благодарю закруглённым краям, парфа не затрудняет обзор, как скартос, но и делает обладателя более уязвимым к атакам с растояния.'

            }

        }
    }
}

export default weaponsRus;