
const castleStablesRus = {

    stablesName: 'Конюшни замка',

    stablesDescr: 'Двигаясь в сторону стойл и переступая через трупы, вы замечаете отсутствие мёртвых лошадей. Это доволи странно, ведь вы чувствуете запах, который характерен этим животным, а значит их точно здесь держали. Вы подходите всё ближе и ближе к конюшням, а в воздухе усиливается запах гнили. Нужно быть начеку. И вот, вы подошли к проткрытым воротам в стойла. Осмотревшись по сторонам, вы заметили справа дверь, которая, возможно ведёт на второй этаж.',
                
    stablesBtn: {

        firstBtn: 'Пройти к стойлам',

        secondBtn: 'Войти в двери'

    },

};

export default castleStablesRus;