
const castleCourtyardRus = {

    title:'Внутренний двор замка',

    descr: 'Войдя во внутренний двор Каструма, вы видите ту же картину, что и при входе в замок: следы битвы и море трупов. Но, самое ужастное - трупный запах, который смешался с запахом гари. Что вы решили делать?',

    button: {

        firstBtn: 'Осмотреть конюшни',

        secondBtn: 'Осмотреть казармы',

        thirdBtn: 'Осмотреть подозрительный труп'
        
    },

    courtyardDeadBody: {

        title: 'Подозрительный труп',

        descr: 'Подойдя поближе к трупу, вы понимаете, что на нём то же одеяние, что вы увидели на мертвеце при входе в замок. Бледная кожа, глаза залитые кровью, следы от многочисленных порезов. Очередной фанатик или культист, которых по миру развелось, как звёзд на небе? Нет, здесь что-то большее. Вряд ли, обычные фанатики напали бы на имперскую крепость, где расквартирован отряд легионеров. И уж точно они бы не справились с профессиональными солдатами. Всё это не к добру. Хм, нужно осмотреть другие места во внутреннем дворе.',
        
        button: {

            firstBtn: 'Осмотреть стойла',

            secondBtn: 'Осмотреть казармы',

            thirdBtn: 'Двигаться в сторону донжона'

        },

        isVisited: false

    }

}

export default castleCourtyardRus;