
const castleStablesRus = {

    stablesName: 'Конюшни замка',

    stablesDescr: 'Двигаясь в сторону стойл и переступая через трупы, вы замечаете отсутствие мёртвых лошадей. Это доволи странно, ведь вы чувствуете запах, который характерен этим животным, а значит их точно здесь держали. Вы подходите всё ближе и ближе к конюшням, а в воздухе усиливается запах гнили. Нужно быть начеку. И вот, вы подошли к проткрытым воротам в стойла. Осмотревшись по сторонам, вы заметили справа дверь, которая, возможно ведёт на второй этаж.',
                
    stablesBtn: {

        firstBtn: 'Пройти к стойлам',

        secondBtn: 'Войти в двери'

    },

    stableDoor: {

        stableDoorName: 'Второй этаж конюшен',

        stableDoorDescr: 'Осторожно проткрыв дверь и посмотрев в дверную щель, вы не обнаружили живых существ. Аккуратно, шаг за шагом вы поднимаетесь на второй этаж. Вы добрались до конца и перед вами снова предстаёт дверь. Прислонив ухо к двери, вы ничего не услышали. Неспеша приоткрыв дверь в комнату, вы решаетесь войти. Перед вами предстаёт пустая комната, а в воздухе витает ужасный трупный запах. Вы очень удивлены тем фактом, что комната пуста. Это довольно таки странно, ведь в отдалённых замках место под гарнизон всегда впритык, а тут, на первый взгляд, солдат больше, чем обычно. Нужно осмотреться, возможно здесь не всё так просто.',
                
        stableDoorBtn: {

            firstBtn: 'Осмотреть стены',

            secondBtn: 'Осмотреть пол',

            thirdBtn: 'Подойти к окну'

        },

    },

    stableWalls: {

        stableWallsName: 'Стены в подозрительной комнате',

        stableWallsDescr: 'Вы решаете начать осмотр стен от дверей по часовой стрелке. Стены сделаны из дерева, то тут, то там видны следы от мебели или следы от гвоздей. Вы не заметили ничего не обычного, пока не дошли до стены, которая расположена напротив двери. На стене очень много зассохших брызгов крови. На полу же видны следы потёртости от чего-то. Если мыслить логично, то такие следы от крови бывают от сильных ударов. По количеству пятен крови, можно предположить, что кого-то здесь пытали. Тогда и следы потёртости на полу принадлежат, скорее всего, стулу, к которому была привязана жертва. Возможно, эта комната была пыточной?',
                
        stableWallsBtn: {

            firstBtn: 'Осмотреть пол',

            secondBtn: 'Подойти к окну'

        },

    },

    stableFloor: {

        stableFloorName: 'Пол на втором этаже',

        stableFloorDescr: 'Начав осмотр пола от двере, вы меденно идёте к противоположной стене. Внимательно осматривая всё до мелочей, вы заметили не естественно расположенные деревянные доски. Подойдя по ближе, вы чувствуете едкий запах токсинов. Вы решаете посмотреть сквозь щели между досками и под полом определённо что-то есть. Похоже, под полом есть какое-то пространство. Аккуратно отодвинув доски, вы спускаетесь вниз. Тут довольно таки тесно, а поверхность, по которой вы идёте скрип так, что вы думаете, что вот-вот провалитесь. Вы двигаетесь в сторону усиливаещегося запаха тксинов и вот, похоже, вы дошли. Перед вами лежит почерневшее...нечто. Вы не можете понять, что это, но определённо - это когда-то было живым организмом, а может и несколькими... В любом случае, тут больше делать нечего, нужно выбираться.',
                
        stableFloorBtn: {

            firstBtn: 'Осмотреть стены',

            secondBtn: 'Подойти к окну'

        },

    },

    stableWindow: {

        stableWindowName: 'Окно на втором этаже',

        stableWindowDescr: '',
                
        stableWindowBtn: {

            firstBtn: 'Осмотреть стены',

            secondBtn: 'Осмотреть пол'

        },

    },

    stableInside: {

    }

};

export default castleStablesRus;