
const castleEntranceRus = {

        title: 'Замок Каструм',

        descr: 'После долгого и изматывающего пути вы наконец-то достигли цели. Взобравшись на холм, вам открылся величественный вид на замок Каструм. Окруженный высокими стенами, он возвышается над озером. К нему ведёт всего одна дорога, по обе стороны которой расположен лес. Чем ближе вы подходите к замку, тем реже становиться лес и тем сильнее чувствуется запах гари... Приблизившись к Каструму в плотную, вы замечаете отсутствие часовых и странные звуки во внутреннем дворе замка. Его ворота выбиты, а перед ними лежат трупы солдат Империи... и одного подозрительного человека. Его одеяние не имеет ничего схожего ни с одной известной вам организацией или государством. Однозначно, здесь что-то не так, как и говорил ваш господин.',

        button:{

                firstBtn: 'Войти в ворота замка'

        }

}

export default castleEntranceRus;