
const donjonInsideText = {

    language: {

        english: {},

        russian: {

            donjonInside: {

                textTitle: 'Внутри донжона',

                textDescr: 'Похоже, что захватчики крепко обосновались тут. Следует ожидать больше врагов в помещениях донжона. Вы осторожно входите внутрь и вот, вы уже стоите в зале, который слегка освещается свечами на стойках в дальних углах. В самом конце зала видены коридоры, которые ведут в разные стороны. Прямо перед коридором стоит статуя Императора-Основателя, правда, слегака изуродована. На ней отсутствует голова, видимо, культисты не особо его любят или они не жалуют все статуи.',

                textButton: {

                    firstButton: 'Подойти к развилке'

                }

            },

            donjonCrossroad: {

                textTitle: 'Распутье',

                textDescr: 'Подойдя к развилке, вам предстоит выбрать, куда идти. Оба коридора освещаються факелами, и похоже вы видите несколько дверей на каждом пути. Где-то вдалеке слышны такие же звуки, какие вы слышали снаружи. Нужно быть предельно осторожными.',

                textButton: {

                    firstButton: 'Пойти направо',

                    secondButton: 'Пройти налево'

                }

            },

            donjonCorridorLeft: {

                textTitle: 'Левый коридор',

                textDescr: 'Проходя коридором, вы замечаете отсутствие трупов, которыми изобиловал внутрений двор. И вот, вы прошли две двери и стоите перед третьей. На двери прибита записка - "На склад вход запрещён по приказу коменданта." Ваши исследования прерывает крик, похожий на крик человека. Друг или враг? Как быто ни было, нужно выяснить. Звук шёл из двери, которая разположенна правее.',

                textButton: {

                    firstButton: 'Осмотреть дверь левее',

                    secondButton: 'Осмотреть дверь правее',

                    thirdButton: 'Осмотреть дверь перед вами',

                    secondButton: 'Пройти в правый коридор'

                }

            },

            donjonDoorToDungeon: {
                
                textTitle: 'Дверь в подвал',

                textDescr: '',

                textButton: {

                    firstButton: 'Отойти от двери',

                    secondButton: 'Пройти в подвал'
                
                }

            },

            donjonDoorToAlchemist: {

                textTitle: 'Дверь к алхимику',

                textDescr: 'При приближении к двери, вы слышите урчание и ворчание за ней. Сквозь дверь вы чувствуете приятный запах разных трав и зелий. Похоже, это лаборатория алхимика. Вернее, была ею.',

                textButton: {

                    firstButton: 'Открыть дверь'
                
                }

            },

            donjonAlchemistRoomBattle: {

                textTitle: 'Лаборатория алхимика',

                textDescr: 'Похоже, вы нашли виновников тех звуков, которые вы слышали. И ещё, вы нашли то, что раньше было телом алхимика. Эти твари сильно изуродовали его и хотят сделать с вами тоже самое. Выбора нет, придётся вступить в бой.',

                textButton: {

                    firstButton: 'Вступить в бой'
                
                }

            },

            donjonAlchemistRoom: {

                textTitle: 'Лаборатория алхимика',

                textDescr: 'После того, как последний противник повержен, вы можете осмотреть лабораторию. Сразу же вам бросилось в глаза рабочее место алхимика. Хоть не все колбы и бутылки уцелели, а большинство ингридиентов разбросаны по комнате, вы можете предположить, что бедолага обладал внушительной алхимической базой. Оно и не удивительно, ведь сдешние леса славяться своими лечебными травами. Однако, эти травы не помогли алхимику и легионерам отбится от нападения. Стоит осмотреться, возможно здесь есть что-то полезное.',

                textButton: {

                    firstButton: 'Осмотреть труп алхимика',

                    secondButton: 'Осмотреть стол алхимика',

                    thirdButton: 'Осмотреть рабочее место'
                
                }

            },

            donjonAlchemistRoomDeadBody: {

                textTitle: 'Труп алхимика',

                textDescr: 'Тело алхимика тяжело узнать, его изрядно потрепало. Похоже, когда-то это был мужчина средних лет. Одет в одеяние Имперского общества алхимиков. Эта организация занимается подготовкой алхимиков для службы в войсках Империи. В руках у него что-то есть. Похоже, что он сжимал какой-то ключ с гравировкой льва. Стоит его забрать.',

                textButton: {

                    firstButton: 'Осмотреть рабочее место',

                    secondButton: 'Осмотреть стол алхимика',

                    thirdButton: 'Выйти из лаборатории'
                
                }

            },

            donjonAlchemistRoomTable: {

                textTitle: 'Стол алхимика',

                textDescr: 'На столе у алхимика лежит множество заметок и записок о зельях, травах и различной живности, которая обитает вокруге. Просмотрев пару бумаг, вы обнаружили письмо с печатью Имперского общества алхимиков. Исходя из содержания письма, одной из задач алхимика было изучение местной флоры и фауны. Особое внимание следовало уделить растению Белый Кейн или "поющий цветок". Немного покопавшись в записях алхимика, вы наткнулись на описание этого цветка: белые лепестки на тонком зелёном стебле, а сма же плод - голубого цвета. Самое удивительное, что в записях алхимика написано, что цветок... "поёт". Не совсем понятно, что это значит, но в лаборатории точно нет ничего, что подходит под описание.',

                textButton: {

                    firstButton: 'Осмотреть рабочее место',

                    secondButton: 'Осмотреть труп алхимика',

                    thirdButton: 'Выйти из лаборатории'
                
                }

            },

            donjonAlchemistRoomWorkplace: {

                textTitle: 'Рабочее место алхимика',

                textDescr: '',

                textButton: {

                    firstButton: 'Осмотреть стол алхимика',

                    secondButton: 'Осмотреть труп алхимика',

                    thirdButton: 'Выйти из лаборатории'
                
                }

            },

            donjonDoorToWarehouseText: {},

            donjonCorridorRightText: {

                textTitle: 'Правый коридор',

                textDescr: '',

                textButton: {

                    firstButton: 'Осмотреть дверь левее',

                    secondButton: 'Осмотреть дверь правее',

                    thirdButton: 'Осмотреть дверь перед вами',

                    secondButton: 'Пройти в правый коридор'

                }

            },
            
        }

    }

};

export { donjonInsideText };