
const donjonInsideText = {

    language: {

        english: {},

        russian: {

            donjonInsideText: {

                textTitle: 'Внутри донжона',

                textDescr: 'Похоже, что захватчики крепко обосновались тут. Следует ожидать больше врагов в помещениях донжона. Вы осторожно входите внутрь и вот, вы уже стоите в зале, который слегка освещается свечами на стойках в дальних углах. В самом конце зала видены коридоры, которые ведут в разные стороны. Прямо перед коридором стоит статуя Императора-Основателя, правда, слегака изуродована. На ней отсутствует голова, видимо, культисты не особо его любят или они не жалуют все статуи.',

                textButton: {

                    firstButton: 'Подойти к развилке'

                }

            },

            donjonCorridorText: {

                textTitle: 'Развилка',

                textDescr: 'Подойдя к развилке, вам предстоит выбрать, куда идти. Оба пути освещаються факелами, и похоже вы видите несколько дверей на каждом пути. Где-то вдалеке слышны такие же звуки, какие вы слышали снаружи. Нужно быть предельно осторожными. ',

                textButton: {

                    firstButton: 'Пойти направо',

                    secondButton: 'Пройти налево'

                }

            },

            donjonCorridorLeft: {

                textTitle: 'Развилка',

                textDescr: 'Идя по коридору, вы замечаете отсутствие трупов, которыми изобиловал внутрений двор. И вот, вы прошли две двери и стоите перед третьей. На двери прибита записка - "На склад вход запрещён по приказу коменданта." Ваши исследования прерывает крик, похожий на крик человека. Друг или враг? Как быто ни было, нужно выяснить. Звук шёл из двери, которая разположенна правее.',

                textButton: {

                    firstButton: 'Осмотреть дверь левее',

                    secondButton: 'Осмотреть дверь правее',

                    thirdButton: 'Осмотреть дверь перед вами',

                    secondButton: 'Пройти в правый коридор'

                }

            },

            donjonCorridorRight: {}
            
        }

    }

};

export { donjonInsideText };